Revit 2026 API

# FamilyInstanceCreationData(FamilySymbol, IListXYZ) Constructor

---

Initializes a new instance of the FamilyInstanceCreationData class

**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FamilyInstanceCreationData(
	FamilySymbol symbol,
	IList<XYZ> adaptivePoints
)
```
```vb
Public Sub New (
	symbol As FamilySymbol,
	adaptivePoints As IList(Of XYZ)
)
```
```cpp
public:
FamilyInstanceCreationData(
	FamilySymbol^ symbol,
	IList<XYZ^>^ adaptivePoints
)
```
```fsharp
new :
        symbol : FamilySymbol *
        adaptivePoints : IList<XYZ> -> FamilyInstanceCreationData
```

#### Parameters

symbol FamilySymbol

adaptivePoints IListXYZ

#### Reference

FamilyInstanceCreationData Class

FamilyInstanceCreationData Overload

Autodesk.Revit.Creation Namespace